def number_to_words(num: int):
    nums = {
        1: "один",
        2: "два",
        3: "три",
        4: "четыре",
        5: "пять",
        6: "шесть",
        7: "семь",
        8: "восемь",
        9: "девять"}
    excep = {
        10: "десять",
        11: "одиннадцать",
        12: "двенадцать",
        13: "тринадцать",
        14: "четырнадцать",
        15: "пятнадцать",
        16: "шестнадцать",
        17: "семнадцать",
        18: "восемнадцать",
        19: "девятнадцать"}

    dec = {
        2: "двадцать ",
        3: "тридцать ",
        4: "сорок ",
        5: "пятьдесят ",
        6: "шестьдесят ",
        7: "семьдесят ",
        8: "восемьдесят ",
        9: "девяносто "}

    if num in excep:
        return excep[num]

    if str(num)[-1] == '0':
        return dec[num // 10][:-1]

    ret = ""

    ret += dec[num // 10 % 10] if len(str(num)) >= 2 and num >= 20 else ""
    ret += nums.get(num % 10, "")

    return ret
